package com.example.ustinova_course

object dataStorage {
    fun getVersionsList():List<CharacterImage> {
        return listOf(
            CharacterImage(R.drawable.diluc,R.drawable.diluc_name,
                "Редкость: 5 звёзд\n" + "Глаз бога: Пиро\n" + "Оружие: Двуручный меч",
                    "Трава-светяшка - 168\n" + "Осколок агата Агнидус - 1\n" + "Фрагмент агата Агнидус - 9\n" + "Кусок агата Агнидус - 9\n" + "Драгоценный агат Агнидус - 6\n" +
                    "Шеврон рядового - 18\n" +
                    "Шеврон сержанта - 30\n" +
                    "Шеврон офицера - 36\n" + "Пылающее семя - 46\n" +
                    "Мора - 420 тыс.\n" + "Опыт героя - 421",
                    "Шеврон рядового - 6\n" +
                    "Шеврон сержанта - 22\n" +
                    "Шеврон офицера - 31\n" +
                    "Учения о «Борьбе» - 3\n" +
                    "Указания о «Борьбе» - 21\n" +
                    "Философия о «Борьбе» - 38\n" +
                    "Перо из хвоста Двалина - 6\n" +
                    "Корона прозрения - 1\n" +
                    "Мора - 1 миллион 650 тысяч.", intArrayOf(R.drawable.wolfsgravestone,R.drawable.redhornstone, R.drawable.prototypearchaic),
                intArrayOf(R.drawable.witch,R.drawable.gladiator,R.drawable.shimenawa)),
            CharacterImage(R.drawable.klee,R.drawable.klee_name,"Редкость: 5 звёзд\n" +
                    "Глаз бога: Пиро\n" +
                    "Оружие: Катализатор","Гриб филанемо - 168\n" +
                    "Осколок агата Агнидус - 1\n" +
                    "Фрагмент агата Агнидус - 9\n" +
                    "Кусок агата Агнидус - 9\n" +
                    "Драгоценный агат Агнидус - 6\n" +
                    "Свиток божественной магии - 18\n" +
                    "Свиток печати - 30\n" +
                    "Свиток запретного проклятья - 36\n" +
                    "Пылающее семя - 46\n" +
                    "Мора - 420 тыс.\n" +
                    "Опыт героя - 421", "Свиток божественной магии - 6\n" +
                    "Свиток печати - 22\n" +
                    "Свиток запретного проклятья - 31\n" +
                    "Учения о «Свободе» - 3\n" +
                    "Указания о «Свободе» - 21\n" +
                    "Философия о «Свободе» - 38\n" +
                    "Кольцо Борея - 6\n" +
                    "Корона прозрения - 1\n" +
                    "Мора - 1 миллион 650 тысяч.",intArrayOf(R.drawable.prayer,R.drawable.skywardatlas,R.drawable.widsith),
            intArrayOf(R.drawable.witch,R.drawable.gladiator,R.drawable.lavawalker)),
            CharacterImage(R.drawable.hutao,R.drawable.hutao_name,"Редкость: 5 звёзд\n" +
                    "Глаз бога: Пиро\n" +
                    "Оружие: Копьё","Шелковица - 168\n" +
                    "Осколок агата Агнидус - 1\n" +
                    "Фрагмент агата Агнидус - 9\n" +
                    "Кусок агата Агнидус - 9\n" +
                    "Драгоценный агат Агнидус - 6\n" +
                    "Нектар попрыгуньи - 18\n" +
                    "Мерцающий нектар - 30\n" +
                    "Элементальный нектар - 36\n" +
                    "Незрелый нефрит - 46\n" +
                    "Мора - 420 тыс.\n" +
                    "Опыт героя - 421","Нектар попрыгуньи - 6\n" +
                    "Мерцающий нектар - 22\n" +
                    "Элементальный нектар - 31\n" +
                    "Учения об «Усердии» - 3\n" +
                    "Указания об «Усердии» - 21\n" +
                    "Философия об «Усердии» - 38\n" +
                    "Осколок дьявольского меча - 6\n" +
                    "Корона прозрения - 1\n" +
                    "Мора - 1 миллион 650 тысяч.", intArrayOf(R.drawable.homa,R.drawable.redsand,R.drawable.dragon),
            intArrayOf(R.drawable.witch,R.drawable.millelith,R.drawable.shimenawa))
        )
    }
}